In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
path = 'C:/Users/Huligesh/Desktop/Abeyaantrix Internship/Dataset/'
file_name = 'Data.csv'
df = pd.read_csv(path + file_name)

In [3]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [7]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [ ]:
- age and salary coulmn has missing values, as these are numerical we  values by mean of the column

In [7]:
df_num = df.select_dtypes(include = np.number)
df_num.head(2)

    Age   Salary
0  44.0  72000.0
1  27.0  48000.0

In [8]:
df_cat = df.select_dtypes(exclude = np.number)
df_cat.head(2)

  Country Purchased
0  France        No
1   Spain       Yes

# Data processing
- this is 3rd and important step in data science workflow, which focuses on making the data suitable for further usage by machine learning algorithm.

- as the data might have various kind of issue/faults in the form of missing data, mispelled data,data of various scales, catagorial etc, these if fed to ML algorithm directly, ML algoritm might not be able understand and provide expected results.

- different steps in data cleanin/data preprocessing, data wrangling
1. Missing data handling (imputation)
2. Catagorical data handling (label encoding, one HOt Encoding)
3. Handling scaling effects (standard scaler, Normalization)
4. Handling data distribution (transformation)

# missing data handling
- two types of missing data : standard and non standard missing data
- data might get missed during the data collection either intentionally or unintentionally

#### What action to  be applied when the data is missing
1. if missing data is numerical :
- discard the row containing missing data, if data size is small we may loss collected information
- replace withmean value of the column
- if the data column has outlier replace with meddian value
- replace with constant value
- come up with own formulation

2. if missing data is catagorical
- discard the row containing missing data, if data size is small we may loss collected information
- replace with mode value of the column
- replace with constant value
- come up with own formulation

In [9]:
df_num
# standard missing values will be read as NaN(not a number) in pandas

    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0
7  48.0  79000.0
8  50.0  83000.0
9  37.0  67000.0

In [10]:
df_num.isnull().sum()

Age       1
Salary    1
dtype: int64

In [12]:
# replace missing values
# when we want replace missing values by average (mean value) use fillna

df_num_filled = df_num.Age.fillna(df_num.Age.mean())
df_num_filled

0    44.000000
1    27.000000
2    30.000000
3    38.000000
4    40.000000
5    35.000000
6    38.777778
7    48.000000
8    50.000000
9    37.000000
Name: Age, dtype: float64

# 2.Handling categorical Data
- categorical data can be nominal, binominal, ordinal

- kavana, usha, bhoomika, adarsh, umesh
- India,USA, China
- In ordinal data: weightage factor is associated between the data categories
- Example: FCD, First class, Secound class, Pass, Fail
- Example: Low, Medium and high

# Binomial: here only two categories will be present
- Example: High low
            Yes No
            Male female
            
# methods for handling categorical data:
1. Label Encoding: assign the numbers to the given categoriess randomly
    - each category will get a particular number
    - suitable when data is ordinal or Binomial
    
2. Ordinal Encoding: assign the specific number to a particular category based on the order of category
    - suitable when data is ordinal
    
3. one hot encoding: providing encoding for each categories to nutize the numers effect
    - sitable for NOmnal data

# 3.Scaling/Normalization

- standard scaler
- In a given dataset data in each column can have different units of measures wich leads to shadowing of one particular data
  column over others, to avoid this kind of bais we need to bring all the data column into same standard (scale) 
- to perform standardization standard scaler can be used 
- advantage of applying standard scaler is that, data will have same distribution even after applying scaling. It keeps the
  original distribution as it is